Revit 2024 API
BuiltInFailures.FamilyFailures.UnexpectedFamilyChangeResultsWarning Property
 Changing the family for a MEP fitting might cause unexpected results.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId UnexpectedFamilyChangeResultsWarning { get; }
Visual Basic
Public Shared ReadOnly Property UnexpectedFamilyChangeResultsWarning As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ UnexpectedFamilyChangeResultsWarning {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace